app/controllers/api/v1/content_templates_controller.rb

SELECT "content_templates".* FROM "content_templates" WHERE ("content_templates"."tenant_id" = '344437fa-6bbc-4744-9aa7-633e2ea61c8f' OR "content_templates"."tenant_id" IS NULL)
---
      def index
        contents = ContentTemplate.where(:tenant_id => [@tenant, nil])