app/controllers/api/v1/incentive_programs_controller.rb

SELECT  "tenants".* FROM "tenants" WHERE "tenants"."id" = $1 LIMIT $2  [["id", "344437fa-6bbc-4744-9aa7-633e2ea61c8f"], ["LIMIT", 1]]
SELECT "incentive_programs".* FROM "incentive_programs" WHERE "incentive_programs"."tenant_id" = $1  [["tenant_id", "344437fa-6bbc-4744-9aa7-633e2ea61c8f"]]
---
      def index
        tenant = Tenant.find(@tenant)
        programsJson = tenant.incentive_programs.all.map { | p | p.include_everything_json }