app/controllers/api/v1/stock_prices_controller.rb

      def index
        tenant = Tenant.find(@tenant)
        render json: { data: tenant.stock_prices.order('date DESC, created_at DESC').limit(20) }, status: :ok
---
SELECT  "tenants".* FROM "tenants" WHERE "tenants"."id" = $1 LIMIT $2  [["id", "344437fa-6bbc-4744-9aa7-633e2ea61c8f"], ["LIMIT", 1]]
SELECT  "stock_prices".* FROM "stock_prices" WHERE "stock_prices"."tenant_id" = $1 ORDER BY date DESC, created_at DESC LIMIT $2  [["tenant_id", "344437fa-6bbc-4744-9aa7-633e2ea61c8f"], ["LIMIT", 20]]