app/controllers/api/v1/tenants_controller.rb

      def index
        tenants = Tenant.order('name')
---
SELECT "tenants".* FROM "tenants" ORDER BY name