app/controllers/api/v1/windows_controller.rb

SELECT  "tenants".* FROM "tenants" WHERE "tenants"."id" = $1 LIMIT $2  [["id", "344437fa-6bbc-4744-9aa7-633e2ea61c8f"], ["LIMIT", 1]]
---
      def index
        tenant = Tenant.find(@tenant)